3A/SE465/Creating-Tests.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-20 Tue 16:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating Tests</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Creating Tests</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org55bd786">1. Creating Test Cases</a>
<ul>
<li><a href="#orgc09048f">1.1. Symbolic Execution</a></li>
<li><a href="#orgf35ea8d">1.2. Path Predicate Expression</a></li>
</ul>
</li>
<li><a href="#org4824577">2. Principles of Maintainable Test Code</a></li>
<li><a href="#org9d3410f">3. Test Smells</a>
<ul>
<li><a href="#org321fd0c">3.1. Eager Test</a></li>
<li><a href="#org3029d00">3.2. Lazy Test</a></li>
<li><a href="#org91bf88e">3.3. Mystery Guest</a>
<ul>
<li><a href="#org3d9ae24">3.3.1. Refactoring: Inline Resource</a></li>
<li><a href="#orgb5cfcf5">3.3.2. Refactoring: Setup External Resource</a></li>
</ul>
</li>
<li><a href="#org2963217">3.4. Resource Optimism</a></li>
<li><a href="#org158df38">3.5. Test Run War</a>
<ul>
<li><a href="#orgfdc90b8">3.5.1. Refactoring: Make Resource Unique</a></li>
</ul>
</li>
<li><a href="#org27b93dc">3.6. General Fixture</a></li>
<li><a href="#orged466d3">3.7. Assertion Roulette</a></li>
<li><a href="#orgf155ff9">3.8. Indirect Testing</a></li>
<li><a href="#org7f18a12">3.9. For Tester Only</a></li>
<li><a href="#org34bc6d1">3.10. Sensitive Equality</a>
<ul>
<li><a href="#org91886e6">3.10.1. Refactoring: Introduce Equality Method</a></li>
</ul>
</li>
<li><a href="#org6e78816">3.11. Test Code Duplication</a></li>
<li><a href="#orgae7e26b">3.12. Other Test Smells</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org55bd786" class="outline-2">
<h2 id="org55bd786"><span class="section-number-2">1.</span> Creating Test Cases</h2>
<div class="outline-text-2" id="text-1">
<p>
In order to increase coverage, one needs to generate
test cases that exercise certain statements or follow
specific paths:
</p>
<ul class="org-ul">
<li>how to make paths execute: generate input data that
satisfies all conditions on the path</li>
<li>key items: input vector, predicate, path predicate,
predicate interpretation, path predicate expression,
create test input from path predicate expression</li>
</ul>

<p>
<b>Input vector</b>: collection of all data entities
read by the routine whose values must be fixed
prior to entering the routine
</p>
<ul class="org-ul">
<li>members include input arguments, global vars and
constants, files, network connections, timers</li>
</ul>

<p>
<b>Predicate</b>: a logical function evaluated at a
decision point
</p>

<p>
<b>Path predicate</b>: the set of predicates associated
with a path
</p>
<ul class="org-ul">
<li>may contain local variables that
<ul class="org-ul">
<li>play no role in selecting inputs that force
a path to execute</li>
<li>cannot be selected independently of the input
variables</li>
<li>are eliminated with symbolic execution</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgc09048f" class="outline-3">
<h3 id="orgc09048f"><span class="section-number-3">1.1.</span> Symbolic Execution</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Symbolically substituting
operations along a path in order to express
the predicate solely in terms of the input
vector and a constant vector.
</p>

<p>
Key idea:
</p>
<ul class="org-ul">
<li>evaluate the program on symbolic input values</li>
<li>use an automated theorem prover to check whether
there are corresponding concrete input values that
make the program fail</li>
</ul>
</div>
</div>
<div id="outline-container-orgf35ea8d" class="outline-3">
<h3 id="orgf35ea8d"><span class="section-number-3">1.2.</span> Path Predicate Expression</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Another name for an interpreted path predicate.
Has the following attributes:
</p>
<ul class="org-ul">
<li>no local variables</li>
<li>a set of constraints in terms of the input vector
and maybe constants</li>
<li>by solving the constraints, inputs that force each
path can be generated</li>
<li>if a path predicate expression has no solution,
the path is infeasible</li>
</ul>

<p>
Can organize the set of path predicates using
a decision table.
</p>
</div>
</div>
</div>
<div id="outline-container-org4824577" class="outline-2">
<h2 id="org4824577"><span class="section-number-2">2.</span> Principles of Maintainable Test Code</h2>
<div class="outline-text-2" id="text-2">
<p>
Tests should be fast. For slower tests:
</p>
<ul class="org-ul">
<li>use mocks or stubs</li>
<li>redesign production code so slower pieces of code
can be tested separately from fast pieces</li>
<li>move slower tests to a different test suite that you
can run less often</li>
</ul>


<p>
Tests should:
</p>
<ul class="org-ul">
<li>be cohesive: test a single behaviour of the system</li>
<li>be independent: not depend on oher tests to succeed</li>
<li>be isolated: clean up their mess and not rely on
existing data</li>
<li>have a reason to exist: find bugs or document behaviour</li>
<li>be repeatable: always give same results no matter how
many times they are executed</li>
<li>have strong assertions: assert that exercised code
behaves exactly as expected and break on any slight
change in the output</li>
<li>break if behaviour changes: TDD can help</li>
<li>have a single reason to fail: test code should help
understand what caused the bug</li>
<li>be easy to write: write good test infrastructure
that does all setup and tear down</li>
<li>be easy to read: all info should be clear enough</li>
<li>be easy to change and evolve: changing should not
be painful, less coupled to production code</li>
</ul>
</div>
</div>
<div id="outline-container-org9d3410f" class="outline-2">
<h2 id="org9d3410f"><span class="section-number-2">3.</span> Test Smells</h2>
<div class="outline-text-2" id="text-3">
<p>
Code smell indicates symptoms that of deeper problems in
source code, hindering comprehensibility and maintainability.
</p>
</div>
<div id="outline-container-org321fd0c" class="outline-3">
<h3 id="org321fd0c"><span class="section-number-3">3.1.</span> Eager Test</h3>
<div class="outline-text-3" id="text-3-1">
<p>
When a test method checks several methods of the object
to be tested, it is hard to read and understand so more
difficult to be used as documentation.
</p>

<p>
Solution: separate test code into test methods that only
test one method
</p>
</div>
</div>
<div id="outline-container-org3029d00" class="outline-3">
<h3 id="org3029d00"><span class="section-number-3">3.2.</span> Lazy Test</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Occurs when several test methods check the same method
using the same fixture.
</p>

<p>
Solution: join them together using inline method
</p>
</div>
</div>
<div id="outline-container-org91bf88e" class="outline-3">
<h3 id="org91bf88e"><span class="section-number-3">3.3.</span> Mystery Guest</h3>
<div class="outline-text-3" id="text-3-3">
<p>
When a test uses external resources, the test is no longer
self-contained so difficult to understand tested
functionality.
Also this introduces hidden dependencies that can cause
tests to fail.
</p>

<p>
Solution: use refactoring inline resource, or if
external resources are needed, apply setup external
resource to remove hidden dependencies.
</p>
</div>
<div id="outline-container-org3d9ae24" class="outline-4">
<h4 id="org3d9ae24"><span class="section-number-4">3.3.1.</span> Refactoring: Inline Resource</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
To remove the dependency between a test and some
external resource, setup a fixture that holds
the same content as the resource that is used to run
the test.
</p>
</div>
</div>
<div id="outline-container-orgb5cfcf5" class="outline-4">
<h4 id="orgb5cfcf5"><span class="section-number-4">3.3.2.</span> Refactoring: Setup External Resource</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
If necessary for a test to rely on external
resources, make sure the test explicitly creates
or allocates these resources before test and
releases them when done.
</p>
</div>
</div>
</div>
<div id="outline-container-org2963217" class="outline-3">
<h3 id="org2963217"><span class="section-number-3">3.4.</span> Resource Optimism</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Test code that makes optimistic assumptions can cause
non-deterministic behaviour in test outcomes (flaky tests).
</p>

<p>
Solution: use setup external resource to allocate
or initialize all resources used.
</p>
</div>
</div>
<div id="outline-container-org158df38" class="outline-3">
<h3 id="org158df38"><span class="section-number-3">3.5.</span> Test Run War</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Arise when tests run differently on different devices,
caused by resource interference.
</p>

<p>
Solution: apply make resource unique to overcome
interference
</p>
</div>
<div id="outline-container-orgfdc90b8" class="outline-4">
<h4 id="orgfdc90b8"><span class="section-number-4">3.5.1.</span> Refactoring: Make Resource Unique</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Can solve issue of overlapping resource names by
using unique IDs for all resources (timestamp).
</p>
</div>
</div>
</div>
<div id="outline-container-org27b93dc" class="outline-3">
<h3 id="org27b93dc"><span class="section-number-3">3.6.</span> General Fixture</h3>
<div class="outline-text-3" id="text-3-6">
<p>
When setup fixtures are too general and different
tests only access part of the fixture, tests run more slowly.
</p>

<p>
Solution: use setup only for the part of fixture shared
by all tests and put the rest of the fixture in the
method that uses it.
</p>
</div>
</div>
<div id="outline-container-orged466d3" class="outline-3">
<h3 id="orged466d3"><span class="section-number-3">3.7.</span> Assertion Roulette</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Comes from having a number of assertions in a test method
that have no explanation, if one fails, it is unknown why.
</p>

<p>
Solution: add assertion explanations
</p>
</div>
</div>
<div id="outline-container-orgf155ff9" class="outline-3">
<h3 id="orgf155ff9"><span class="section-number-3">3.8.</span> Indirect Testing</h3>
<div class="outline-text-3" id="text-3-8">
<p>
A test class should test its counterpart in production code,
not other classes.
</p>

<p>
Solution: move tests to appropriate class
</p>
</div>
</div>
<div id="outline-container-org7f18a12" class="outline-3">
<h3 id="org7f18a12"><span class="section-number-3">3.9.</span> For Tester Only</h3>
<div class="outline-text-3" id="text-3-9">
<p>
When a production class contains methods only used by test methods.
</p>

<p>
Solution: methods can be removed or are only needed to setup tests
in which case they should be moved to test code
</p>
</div>
</div>
<div id="outline-container-org34bc6d1" class="outline-3">
<h3 id="org34bc6d1"><span class="section-number-3">3.10.</span> Sensitive Equality</h3>
<div class="outline-text-3" id="text-3-10">
<p>
Tests may depend on irrelevant details for equality checks.
</p>

<p>
Solution: introduce equality method
</p>
</div>
<div id="outline-container-org91886e6" class="outline-4">
<h4 id="org91886e6"><span class="section-number-4">3.10.1.</span> Refactoring: Introduce Equality Method</h4>
<div class="outline-text-4" id="text-3-10-1">
<p>
If an object structure needs to be checked for equality in
tests, add an implementation for the equals method.
</p>
</div>
</div>
</div>
<div id="outline-container-org6e78816" class="outline-3">
<h3 id="org6e78816"><span class="section-number-3">3.11.</span> Test Code Duplication</h3>
<div class="outline-text-3" id="text-3-11">
<p>
Test code can have duplication of responsibility.
</p>

<p>
Solution: can be removed by extracting methods
</p>
</div>
</div>
<div id="outline-container-orgae7e26b" class="outline-3">
<h3 id="orgae7e26b"><span class="section-number-3">3.12.</span> Other Test Smells</h3>
<div class="outline-text-3" id="text-3-12">
<p>
Other examples are redundant assertions, unknown tests (without
assertion), empty test, and duplicate assertions.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-20 Tue 16:08</p>
</div>
</body>
</html>
